ClearMaterialAspect Method
 Removes an aspect from the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void ClearMaterialAspect(
	MaterialAspect aspect
)
Visual Basic
Public Sub ClearMaterialAspect ( _
	aspect As MaterialAspect _
)
Visual C++
public:
void ClearMaterialAspect(
	MaterialAspect aspect
)
Parameters
aspect
Type: Autodesk.Revit.DBMaterialAspect
 The material aspect.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →